#include "RouteControl.h"
#include "Global.h"
#include "Ground.h"

//实际速度
int32_t Speed[40][4] = {0};

//中速,默认速度
int32_t M_Speed[40][4] = 
{
     /*跷跷板路径*/
    {1800,1600,3000,2500},/*第1条路径：出启动区*/
    {1600,1500,2500,2500},/*第2条路径：开始旋转*/
    {1500,1000,2500,2000},/*第3条路径：圆弧切圆*/  //降速5.31
    {1000,2200,1800,2500},/*第4条路径：跷跷板巡线到交接完成*/
    {2200,1300,1800,1800},/*第5条路径，交接完成之后加速*/
    {   0,   0,2500,2500},/*第6条路径：压跷跷板处停车，等待压完跷跷板*/
    {2200,1300,2500,1800},/*第7条路径：压完跷跷板之后圆弧返回到交接处*/
    {1300,1600,2500,2500},/*第8条路径：跷跷板交接之后的一段小直线*/
     /*第一次途中*/
    {1600, 800,2500,2500}, /*##第9条路径：斜线前往秋千区*/
     /*秋千路径*/
    { 800,   0,2500,2500},/*第10条路径：秋千巡线*/
    {   0,   0,2500,2500},/*第11条路径：秋千交接处，停车锁点*/
    {1500,   0,2500,2500},/*第12条路径:后退一点点*/
    {   0,   0,2500,2500},/*第13条路径：等待交接动作完成*/
    {1500,   0,2500,2500},/*第14条路径：交接完成后退*/
    {   0,   0,2500,2500}, /*第15条路径：秋千等待三次荡完，之后前进到秋千交接处*/
    {1200,   0,2500,2500},/*第16调路径，荡完之后前进取车*/
    {   0,   0,2500,2500},/*第17条路径：锁点等待取到自动车*/
    {1600,2000,2000,2000},/*第18条：取到自动车之后后退*/
     /*第二次途中*/
    {2000,2600,3200,3200},/*第19条路径：折线离开秋千*/
    {2600,2000,3200,2500},/*第20条路径：小段直线*/
    {2000, 800,3200,1800},/*##第21条路径：折线之后面对梅花桩*/
     /*梅花桩路径*/
    { 800,   0,2500,2500},/*第22条路径：DT50巡线定位梅花桩*/
    { 400,   0,2500,2500},/*第23条路径:交接之后挤压一段时间*/
    {2500,1200,2500,2500}, /*第24条路径：后退之后弧线*/
    {1200,   0,2500,2500}, /*第25条路径：接DT50巡线,交接梅花桩*/
/*0*/{0,0,2500,2500},/*26,停车等待自动车到位*/
    { 400,   0,2500,2500},/*27,前进取车*/  //700取车过快，发生失误
/*0*/{0,0,2500,2500},/*28*///修改巡线速度，停车取车
    {2000,2000,1500,2500},/*第29条路径：交接之后直线离开梅花桩*/
     /*第三次途中*/
    {2000,2000,2500,2500},/*第30条路径：直线旋转*/
    {2000,1000,2500,2000},/*第31条路径：平移前往梯子*/
     /*梯子*/
    {1000, 600,2500,1800}, /*第32条路径：DT50瞄准梯子*/  //这个速度很好，不要改了
    { 600, 400,2500,2500}, /*第33条路径：DT50瞄准梯子*/  //这个速度很好，不要改了
    { 400, 200,2500,2500},/*第34条路径：找到梯子，前进放车*/  //这个速度很好，不要改了
    {   0,   0,2500,2500},/*35，到达梯子前面，手动确认*/
    { 500,   0,2500,2500},/*第36条路径：交接完成之后后退*/
};


//高速
int32_t H_Speed[40][4] = 
{
     /*跷跷板路径*/
    {2200,1800,3000,2500},/*第1条路径：出启动区*/
    {1800,1500,2500,2000},/*第2条路径：开始旋转*/
    {1500,1000,2500,2000},/*第3条路径：圆弧切圆*/
    {1000,2300,1800,2500},/*第4条路径：跷跷板巡线到交接完成*/
    {2300,1500,1800,2000},/*第5条路径，交接完成之后加速*/
    {   0,   0,2500,2500},/*第6条路径：压跷跷板处停车，等待压完跷跷板*/
    {2200,1400,3000,1800},/*第7条路径：压完跷跷板之后圆弧返回到交接处*/
    {1400,1800,2500,2500},/*第8条路径：跷跷板交接之后的一段小直线*/
     /*第一次途中*/
    {1800, 800,2500,2500}, /*##第9条路径：斜线前往秋千区*/
     /*秋千路径*/
    { 800,   0,2500,2500},/*第10条路径：秋千巡线*/
    {   0,   0,2500,2500},/*第11条路径：秋千交接处，停车锁点*/
    {1500,   0,2500,2500},/*第12条路径:后退一点点*/
    {   0,   0,2500,2500},/*第13条路径：等待交接动作完成*/
    {1500,   0,2500,2500},/*第14条路径：交接完成后退*/
    {   0,   0,2500,2500}, /*第15条路径：秋千等待三次荡完，之后前进到秋千交接处*/
    {1200,   0,2500,2500},/*第16调路径，荡完之后前进取车*/
    {   0,   0,2500,2500},/*第17条路径：锁点等待取到自动车*/
    {1600,2600,2500,3000},/*第18条：取到自动车之后后退*/
     /*第二次途中*/
    {2600,2600,3500,3500},/*第19条路径：折线离开秋千*/
    {2600,2200,3500,3500},/*第20条路径：小段直线*/
    {2200,800,3500,2200},/*##第21条路径：折线之后面对梅花桩*/  //改为800求稳
     /*梅花桩路径*/
    {800,   0,2500,2500},/*第22条路径：DT50巡线定位梅花桩*/
    { 400,   0,2500,2500},/*第23条路径:交接之后挤压一段时间*/
    {2500,1200,2500,2500}, /*第24条路径：后退之后弧线*/
    {1200,   0,2500,2500}, /*第25条路径：接DT50巡线,交接梅花桩*/
/*0*/{0,0,2500,2500},/*26,停车等待自动车到位*/
    { 400,   0,2500,2500},/*27,前进取车*/  //600取车过快，发生失误
/*0*/{0,0,2500,2500},/*28*///修改巡线速度，停车取车
    {2000,2300,1800,2500},/*第29条路径：交接之后直线离开梅花桩*/
     /*第三次途中*/
    {2300,2300,2500,2500},/*第30条路径：直线旋转*/
    {2300,1000,2500,2000},/*第31条路径：平移前往梯子*/
     /*梯子*/
    {1000, 600,2500,1800}, /*第32条路径：DT50瞄准梯子*/  //这个速度很好，不要改了
    { 600, 400,2500,2500}, /*第33条路径：DT50瞄准梯子*/  //这个速度很好，不要改了
    { 400, 200,2500,2500},/*第34条路径：找到梯子，前进放车*/  //这个速度很好，不要改了
    {   0,   0,2500,2500},/*35，到达梯子前面，手动确认*/
    { 500,   0,2500,2500},/*第36条路径：交接完成之后后退*/
};


//走场速度
int32_t Speed_Ground_Test[40][4] = 
{
     /*跷跷板路径*/
    {1300,1300,2500,2500},/*第1条路径：出启动区*/
    {1300,1300,2500,2500},/*第2条路径：开始旋转*/
    {1300,0,2500,2500},/*##第3条路径：圆弧切圆*/
    {1200,1800,2000,2500},/*第4条路径：跷跷板巡线到交接完成*/
    {1800,1200,2500,2500},/*第5条路径，交接完成之后加速*/
    {0,0,2500,2500},/*第6条路径：压跷跷板处停车，等待压完跷跷板*/
    {1500,1500,2500,2500}, /*第7条路径：压完跷跷板之后圆弧返回到交接处*/
    {1500,1600,2500,2500},/*第8条路径：跷跷板交接之后的一段小直线*/
     /*第一次途中*/
    {1600,0,2500,2500}, /*##第9条路径：斜线前往秋千区*/
     /*秋千路径*/
    {800 ,0,2500,2500},/*第10条路径：秋千巡线*/
    {0,0,2500,2500},/*第11条路径：秋千交接处，停车锁点*/
    {1500,0,2500,2500},/*第12条路径:后退一点点*/
    {0,0,2500,2500},/*第13条路径：等待交接动作完成*/
    {1500,0,2500,2500},/*第14条路径：交接完成后退*/
    {0,0,2500,2500}, /*第15条路径：秋千等待三次荡完，之后前进到秋千交接处*/
    {1200,0,2500,2500},/*第16调路径，荡完之后前进取车*/
    {0,0,2500,2500},/*第17条路径：锁点等待取到自动车*/
    {1500,1500,2500,2000},/*第18条：取到自动车之后后退*/
     /*第二次途中*/
    {2000,2000,3000,3000},/*第19条路径：折线离开秋千*/
    {2000,1800,3000,3000},/*第20条路径：小段直线*/
    {1800, 0,3000,2000},/*##第21条路径：折线之后面对梅花桩*/
     /*梅花桩路径*/
    {800,0,2500,2500},/*第22条路径：DT50巡线定位梅花桩*/
    {400,0,2500,2500},/*第23条路径:交接之后挤压一段时间*/
    {1500,500,2500,2500}, /*第24条路径：后退之后弧线*/
    {500,0,2500,2500}, /*第25条路径：接DT50巡线,交接梅花桩*/
/*0*/{0,0,2500,2500},/*26,停车等待自动车到位*/
    {500,0,2500,2500},/*27,前进取车*/
/*0*/{0,0,2500,2500},/*28*///修改巡线速度，停车取车
    {1800,1800,1500,2500},/*第29条路径：交接之后直线离开梅花桩*/
     /*第三次途中*/
    {1800,1800,2500,2500},/*第30条路径：直线旋转*/
    {1800,1200,2500,2500},/*第31条路径：平移前往梯子*/
     /*梯子*/
    {1200,600,2500,2000}, /*第32条路径：DT50瞄准梯子*/
    {500,500,2500,2500}, /*第33条路径：DT50瞄准梯子*/
    {500,200,2500,2500},/*第34条路径：找到梯子，前进放车*/
    {0,0,2500,2500},/*35，到达梯子前面，手动确认*/
    {800,0,2500,2500},/*第36条路径：交接完成之后后退*/
};


